Основные_объекты_КР/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <posting>Deny</posting>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Основные_объекты_КР/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаПоДокументу = Товары.Итог("Сумма");
	
	ПороговаяСумма = Константы.СуммаПокупкиДляБесплатнойДоставки.Получить();
	
	Если ПороговаяСумма <= 0 Тогда
		ПороговаяСумма = 1000; // значение по умолчанию, если пользователь не заполнил константу
	КонецЕсли;
	
	Если СуммаПоДокументу >= ПороговаяСумма Тогда
		
		ДополнительныеСвойства.Вставить("Текст","----------- ВНИМАНИЕ! -----------
		|Покупатель приобрел товаров на общую сумму " + Формат(СуммаПоДокументу, "ЧДЦ=2") +
		" руб. Возможна бесплатная доставка товаров клиенту.");
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ДополнительныеСвойства.Текст;
		Сообщение.Сообщить();

	КонецЕсли;
	
КонецПроцедуры
